{
  /* if set to true, animals will be petted each day */
  "PetAnimals": true,
  /* defaults to 5. the amount of friendship each animal gains when you collect milk/wool from it. */
  "AdditionalFriendshipFromCollecting": 5,

  /* the machines from which their finished product should automatically be collected. if it's a machine you can put items in, it will also look for items to put in afterwards */
  "MachinesToCollectFrom": "Keg, Preserves Jar, Cheese Press, Mayonnaise Machine, Loom, Oil Maker, Recycling Machine, Crystalarium, Worm Bin, Bee House, Strange Capsule, Tapper, Statue Of Endless Fortune, Furnace, Seed Maker",
  /* these items are considered a connection. if a machine is not connected to a chest (either by being adjecant or by an adjecant machine being connected) nothing will happen.
  for example, you can add Fence and Gate if you want those to be considered for connections as well.
  */
  "ItemsToConsiderConnectors": "Keg, Preserves Jar, Cheese Press, Mayonnaise Machine, Loom, Oil Maker, Recycling Machine, Crystalarium, Worm Bin, Bee House, Strange Capsule, Tapper, Statue Of Endless Fortune, Furnace, Seed Maker, Chest",

  /* the following floor tiles are considered connector. be careful, if you have lots of these floors, your whole farm might connect to the same chest and the mod might
     accidentally add items to your machines you'd rather keep.

     by default only boardwalks are enabled (few people seem to use them). use these to connect your machines to chests or add another type of flooring of your liking by 
     adding numbers from below comma separated into the list. For example:
            "FlooringsToConsiderConnector": { 6, 7, 8 },

     Floor types:
      Wood Floor = 0;
      Stone Floor = 1;
      Weathered Floor = 2;
      Crystal Floor = 3;
      Straw Floor = 4;
      Gravel Path = 5;
      Wood Path = 6;
      Crystal Path = 7;
      Cobblestone Path = 8;
      Stepping Stone Path = 9;
    */
  "FlooringsToConsiderConnectors": [ 6 ],

  /* the names of the game locations where machines are searched for.  */
  "LocationsToSearch": "Farm, Greenhouse, FarmHouse, FarmCave",

  /* should farm buildings be searched for machines as well? */
  "AddBuildingsToLocations": true,

  /* enable or disable the mod */
  "EnableMod": true
}